/**
 * Created by huangye on 2018/1/8.
 */
let em_chooseField = ["公司编号", "公司名称", "雇员编号", "雇员姓名", "身份证号码", "开F单日期", "服务中心", "办理类型", "用工操作员", "用工方式", "缴费区县", "用工属性", "用工材料批退日期", "档案编号", "预留档案编号", "存档地", "用工反馈操作日期", "档案操作员", "入库日期", "出库日期", "手册入库日期", "补调档案1", "补调档案2", "UKey外借日期", "UKey返回日期", "高校调档日期", "寄回执日期", "修改档案编号提交日期", "完成改号日期", "前道提交退工任务单日期", "退工原因", "出库人", "档案材料借出日期", "档案材料借阅日期"];
let em_relationship = {
  "等于": "==",
  "大于": ">",
  "大于等于": ">=",
  "小于": "<",
  "小于等于": "<=",
  "不等于": "<>",
  "类似于": "like",
  "为空": "is null"
};
let em_print = ["用工录用名册打印", "派谴录用名册打印", "外来独立", "外来派谴", "采集表汇总表", "打印批退材料签收单"];

let customerInfo = {
  customerNumber: "340078",
  customerName: "上海XX信息技术有限公司",
  employeeNumber: "GY001",
  employeeName: "张三",
  reservedFileNumber: "YY0001",
  IdNumber: "35220219781124114",
  fileNumber: "10001"
};

let batchOperate = ["退材料交付日期", "转移备注", "转移方式", "退工反馈", "退工反馈2", "退档日期", "档案转出方向", "档案转出日期", "手册转出日期", "公司集体转出方向", "网办", "劳动手册是否交被退人员", "已交", "未交", "职介反馈日期", "打印退工单", "UKey外借日期", "UKey返回日期"];

export {em_chooseField, em_relationship, em_print, customerInfo, batchOperate}
